app/Livewire/Admin/Category/CategoryCreateComponent.php

insert into `categories` (`title`, `parent_id`, `slug`, `updated_at`, `created_at`) values ('Test Category 1.2', '9', 'test-category-1-2', '2025-04-24 09:58:33', '2025-04-24 09:58:33')
---
    public function save()
    {
        $validated = $this->validate([
            'title' => 'required|max:255',
            'parent_id' => 'required|integer',
        ]);

        $category = Category::query()->create($validated);